# Pandas Tutorial

In [4]:
import pandas as pd

In [6]:
#Chack Pandas version
print(pd.__version__)

1.4.4

# Series create, manipulate, qyerry delete

In [7]:
# Creating a series from list
arr = [0,1,2,3,4]
s1 = pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [9]:
order = [1,2,3,4,5]
s2 = pd.Series(arr, index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [53]:
import numpy as np
n=np.random.randn(5) # Create a randon Array
index = ['a','b','c','d','e']
s3 = pd.Series(n, index = index)
s3

a   -1.167362
b    0.415740
c    0.452229
d    1.892902
e    1.210864
dtype: float64

In [12]:
#create a Series from a dictionary
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s4 = pd.Series(d)
s4

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [16]:
# You can modify the index of series
print(s1)
s1.index = ['A','B','C','D','E']
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [24]:
#slicing
s1[:3]

A    0
B    1
C    2
dtype: int64

In [26]:
s5 = s1.append(s4)
s5

C:\Users\sreenath\AppData\Local\Temp\ipykernel_20984\2832742118.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s5 = s1.append(s4)

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [28]:
s5.drop('e')

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64

# Series Operations

In [31]:
arr1 = [0,1,2,3,4,5,7]
arr2 = [6,7,8,9,5]

In [32]:
s6 = pd.Series(arr2)
s6

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [33]:
s7 = pd.Series(arr1)
s7

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [34]:
s6.add(s7)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [35]:
s6.sub(s7)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [45]:
s8 = s6.mul(s7)
s8

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [39]:
s6.div(s7)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [48]:
print('Median', s8.median())
print('Max', s8.max())
print('Min', s8.min())
print('Mean', s8.mean())

Median 16.0
Max 27.0
Min 0.0
Mean 14.0

# Create DataFrame

In [57]:
dates = pd.date_range('today',periods=6) #Define time sequence as index
num_arr = np.random.randn(6,4) # Import numpy randon array
columns = ['A','B','C','D']

df1 = pd.DataFrame(num_arr, index=dates, columns=columns)
df1

                                   A         B         C         D
2023-03-17 11:16:18.926665  1.343708 -0.135303 -1.816736  0.552729
2023-03-18 11:16:18.926665  0.580009 -0.880215 -0.356133  1.082326
2023-03-19 11:16:18.926665 -1.094261  0.508263 -0.226615  2.422935
2023-03-20 11:16:18.926665 -1.231005  0.109415  1.485461 -0.869212
2023-03-21 11:16:18.926665  1.101994 -0.715076 -0.833243 -0.325835
2023-03-22 11:16:18.926665  0.737332 -0.593328  0.468343  1.351332

In [68]:
# Create dataframe with dictionatry array
data = {'anumal':['cat', 'cat', 'snake', 'dog','dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
       'age':[2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
       'visits':[1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
       'priority' : ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df2 = pd.DataFrame (data,index=labels)
df2

  anumal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [69]:
# See datatypes of array
df2.dtypes

anumal       object
age         float64
visits        int64
priority     object
dtype: object

In [70]:
df2.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [76]:
df2.T

            a    b      c    d    e    f      g    h    i    j
anumal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5  3.0    0.5  NaN  5.0  2.0    4.5  NaN  7.0  3.0
visits      1    3      2    3    2    3      1    1    2    1
priority  yes  yes     no  yes   no   no     no  yes   no   no

In [77]:
df2.sort_values(by='age')

  anumal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [89]:
df3=df2.copy()
meanage = df3['age'].mean()
df3['age'].fillna(meanage)

a    2.5000
b    3.0000
c    0.5000
d    3.4375
e    5.0000
f    2.0000
g    4.5000
h    3.4375
i    7.0000
j    3.0000
Name: age, dtype: float64

In [95]:
df4=df2.copy()
df4.dropna(how='any')

  anumal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
i    dog  7.0       2       no
j    dog  3.0       1       no

# Dataframe file operatuions

In [96]:
df3.to_csv('animal.csv')